Console.Clear();
Console.Write("Введите число: ");
string n = Console.ReadLine();
Console.Write(n[n.Length -2]);

/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1*/